Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Retrieves a category object corresponding to the category ID.
document: The document.
categoryId: An category ID.
Returns: Returns a category object corresponding to the category ID.
Since:  2016

Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object corresponding to a BuiltInCategory ID.
document: The document.
categoryId: A build in category ID.
Returns: Returns a category object corresponding to a BuiltInCategory ID.
Since:  2016